README.org
#+TITLE: Convert =YAML= to JACoW Template
#+AUTHOR: Joshua Peters, Zhichu Chen (Ross)

#+STARTUP: show3levels

#+EXPORT_FILE_NAME: index
#+PROPERTY: header-args    :noweb tangle :tangle no :exports code :eval no

#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/js/readtheorg.js"></script>

* Introduction

“Author Title Check” is a tedious job during JACoW proceedings preparations. This tool intends to provide a tool to automatically generate the template for the authors when they submit their abstracts.

Ideally, the web server can collect the information of the title, the author list, and the corresponding affiliation list of each author. Let’s assume it can export the configuration to a =YAML= file, what we need now is to parse it and export a template that can be directly used by the authors.

There’re three things need to be clarify:
- It doesn’t have to be =YAML=. Any format will do as long as it can be parsed. =JSON= is fine. =XML= needs additional efforts for the code because another library will be used.
- There are two variants of the author-affiliation list described in the [[https://github.com/JACoW-org/JACoW_Templates][template]]. Ross thought one of them is ambiguous so there will be no option to choose it in this version.
- Right now, this will only focus on LaTeX.

* Configuration

The =YAML= file is supposed to have the following form:
#+begin_src yaml
  title:
    caption: This is the CAPTION
    funds:
      - Funded by A
      - Funded by B
  authors:
  - name:
      firstName: John
      lastName:  Doe
      otherFields: will be ignored
    type: primary
    email: john.doe@first.author
    address:
    - name: Inst. A
      address: Addr. A
      zip: '123456'
#+end_src

** Datatype definitions
:PROPERTIES:
:header-args: :mkdirp yes
:END:

*** Main file
:PROPERTIES:
:header-args: :tangle JACoW/Types.hs :noweb tangle
:END:

This library will be imported by my program.

Use pragmas
#+begin_src haskell
  <<type-pragma>>
#+end_src

#+begin_src haskell
  module JACoW.Types where
#+end_src

Import libraries
#+begin_src haskell
  <<type-imports>>
#+end_src

The =Data.Text= library is needed as this will be the main data type for the LaTeX strings:
#+begin_src haskell
  import Data.Text hiding
         (
           <<type-data-text-hide>>
         )
#+end_src

The =Data.List= library is also needed to manipulate list objects:
#+begin_src haskell
  import Data.List hiding
         (
           <<type-data-list-hide>>
         )
#+end_src


The =Prelude= library will be imported at the end to ensure everything is already in scope and we will have no warnings:
#+begin_src haskell
  import Prelude hiding
         (
           <<type-prelude-hide>>
         )
#+end_src

Create typeclasses
#+begin_src haskell
  <<type-class>>
#+end_src

Define handy functions
#+begin_src haskell
  <<type-function>>
#+end_src

And our data type and corresponding typeclasses
#+begin_src haskell
  <<type-defs>>
#+end_src

*** Pragma
:PROPERTIES:
:header-args: :noweb-ref type-pragma
:END:

Automatically convert =String= inside double quotation marks to =Text=
#+begin_src haskell
  {-# LANGUAGE OverloadedStrings #-}
#+end_src

