index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-29 Tue 21:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Convert =YAML= to JACoW Template</title>
<meta name="author" content="Joshua Peters, Zhichu Chen (Ross)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Convert <code>YAML</code> to JACoW Template</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb5ea4a9">1. Introduction</a></li>
<li><a href="#org360369b">2. Configuration</a>
<ul>
<li><a href="#org403caf3">2.1. Datatype definitions</a>
<ul>
<li><a href="#org02f5d9b">2.1.1. Main file</a></li>
<li><a href="#orgcf3f3d1">2.1.2. Pragma</a></li>
<li><a href="#org13b6859">2.1.3. AuthorTitle</a></li>
</ul>
</li>
<li><a href="#org2840d93">2.2. YAML generation</a></li>
</ul>
</li>
<li><a href="#orgf138fb4">3. Application</a></li>
<li><a href="#orgfcd2727">4. Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5ea4a9" class="outline-2">
<h2 id="orgb5ea4a9"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
“Author Title Check” is a tedious job during JACoW proceedings preparations. This tool intends to provide a tool to automatically generate the template for the authors when they submit their abstracts.
</p>

<p>
Ideally, the web server can collect the information of the title, the author list, and the corresponding affiliation list of each author. Let’s assume it can export the configuration to a <code>YAML</code> file, what we need now is to parse it and export a template that can be directly used by the authors.
</p>

<p>
There’re three things need to be clarify:
</p>
<ul class="org-ul">
<li>It doesn’t have to be <code>YAML</code>. Any format will do as long as it can be parsed. <code>JSON</code> is fine. <code>XML</code> needs additional efforts for the code because another library will be used.</li>
<li>There are two variants of the author-affiliation list described in the <a href="https://github.com/JACoW-org/JACoW_Templates">template</a>. Ross thought one of them is ambiguous so there will be no option to choose it in this version.</li>
<li>Right now, this will only focus on LaTeX.</li>
</ul>
</div>
</div>

<div id="outline-container-org360369b" class="outline-2">
<h2 id="org360369b"><span class="section-number-2">2.</span> Configuration</h2>
<div class="outline-text-2" id="text-2">
<p>
The <code>YAML</code> file is supposed to have the following form:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #005e8b;">title</span>:
  <span style="color: #005e8b;">caption</span>: This is the CAPTION
  <span style="color: #005e8b;">funds</span>:
    - Funded by A
    - Funded by B
<span style="color: #005e8b;">authors</span>:
- <span style="color: #005e8b;">name</span>:
    <span style="color: #005e8b;">firstName</span>: John
    <span style="color: #005e8b;">lastName</span>:  Doe
    <span style="color: #005e8b;">otherFields</span>: will be ignored
  <span style="color: #005e8b;">type</span>: primary
  <span style="color: #005e8b;">email</span>: john.doe@first.author
  <span style="color: #005e8b;">address</span>:
  - <span style="color: #005e8b;">name</span>: Inst. A
    <span style="color: #005e8b;">address</span>: Addr. A
    <span style="color: #005e8b;">zip</span>: <span style="color: #3548cf;">'123456'</span>
</pre>
</div>
</div>

<div id="outline-container-org403caf3" class="outline-3">
<h3 id="org403caf3"><span class="section-number-3">2.1.</span> Datatype definitions</h3>
<div class="outline-text-3" id="text-2-1">
</div>

<div id="outline-container-org02f5d9b" class="outline-4">
<h4 id="org02f5d9b"><span class="section-number-4">2.1.1.</span> Main file</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
This library will be imported by my program.
</p>

<p>
Use pragmas
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span>pragma<span style="color: #005e8b;">&gt;&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">module</span> <span style="color: #005f5f; font-weight: bold;">JACoW.Types</span> <span style="color: #531ab6; font-weight: bold;">where</span>
</pre>
</div>

<p>
Import libraries
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span>imports<span style="color: #005e8b;">&gt;&gt;</span>
</pre>
</div>

<p>
The <code>Data.Text</code> library is needed as this will be the main data type for the LaTeX strings:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Data.Text</span> <span style="color: #531ab6; font-weight: bold;">hiding</span>
       <span style="color: #000000;">(</span>
         <span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span><span style="color: #531ab6; font-weight: bold;">data</span><span style="color: #005e8b;">-</span>text<span style="color: #005e8b;">-</span>hide<span style="color: #005e8b;">&gt;&gt;</span>
       <span style="color: #000000;">)</span>
</pre>
</div>

<p>
The <code>Data.List</code> library is also needed to manipulate list objects:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Data.List</span> <span style="color: #531ab6; font-weight: bold;">hiding</span>
       <span style="color: #000000;">(</span>
         <span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span><span style="color: #531ab6; font-weight: bold;">data</span><span style="color: #005e8b;">-</span>list<span style="color: #005e8b;">-</span>hide<span style="color: #005e8b;">&gt;&gt;</span>
       <span style="color: #000000;">)</span>
</pre>
</div>


<p>
The <code>Prelude</code> library will be imported at the end to ensure everything is already in scope and we will have no warnings:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Prelude</span> <span style="color: #531ab6; font-weight: bold;">hiding</span>
       <span style="color: #000000;">(</span>
         <span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span>prelude<span style="color: #005e8b;">-</span>hide<span style="color: #005e8b;">&gt;&gt;</span>
       <span style="color: #000000;">)</span>
</pre>
</div>

<p>
Create typeclasses
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span><span style="color: #531ab6; font-weight: bold;">class</span><span style="color: #005e8b;">&gt;&gt;</span>
</pre>
</div>

<p>
Define handy functions
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span>function<span style="color: #005e8b;">&gt;&gt;</span>
</pre>
</div>

<p>
And our data type and corresponding typeclasses
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b;">&lt;&lt;</span><span style="color: #531ab6; font-weight: bold;">type</span><span style="color: #005e8b;">-</span>defs<span style="color: #005e8b;">&gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf3f3d1" class="outline-4">
<h4 id="orgcf3f3d1"><span class="section-number-4">2.1.2.</span> Pragma</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Automatically convert <code>String</code> inside double quotation marks to <code>Text</code>
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #a0132f;">{-# LANGUAGE OverloadedStrings #-}</span>
</pre>
</div>
</div>
</div>
