README.org
*** AuthorTitle
:PROPERTIES:
:header-args: :noweb-ref type-defs
:END:

Define a class that allows data be converted to LaTeX strings:
#+begin_src haskell :noweb-ref type-class
  class LaTeXable a where
      totitle :: a -> [Affiliation] -> Text
#+end_src
This =totitle= function takes the data and the affiliation list, then returns the LaTeX string.

Define a =simpletitle= command to convert the data when the affiliation list is not needed:
#+begin_src haskell :noweb-ref type-function
  simpletitle :: (LaTeXable a) => a -> Text
  simpletitle = flip totitle []
#+end_src
It’s just not necessary to define it in the =LaTeXable= class.

The =YAML= configuration consists of two entries: a title, and an author list:
#+begin_src haskell
  data AuthorTitle = AuthorTitle
                     { title   :: Title
                     , authors :: [Author]
                     } deriving (Show)
#+end_src

We need to read the =title= entry to the =title= field (first one) and the =authors= entry to the =authors= field (second one):
#+begin_src haskell
  instance FromJSON AuthorTitle where
    parseJSON (Object v) =
      AuthorTitle    <$>
      v .:   "title" <*>
      v .:   "authors"
    parseJSON _ = fail "Expected Object for Config value"
#+end_src
=FromJSON= and other stuffs need to be imported from =Data.Yaml=:
#+begin_src haskell :noweb-ref type-imports
  import Data.Yaml
#+end_src
and these fancy operators =<$>=, =<*>= from =Control.Applicative=:
#+begin_src haskell :noweb-ref type-imports
  import Control.Applicative
#+end_src

Converting =AuthorTitle= to LaTeX is easy: converting both =title= and =authors=, then stick them together with a newline character:
#+begin_src haskell
  instance LaTeXable AuthorTitle where
    totitle (AuthorTitle t as) _  = unlines [totitle t affs, authorTeX (unTeXlines ([unlines auths] <> fmap toAff (zip [1..] affs)))]
      where
        affs = fromMaybe [] (nub <$> (foldl1 (<>) $ fmap addresses as))
        auths = fmap (flip totitle affs) as
        toAff (n,aff) = supTeX ((pack.show) n) <> totitle aff affs
#+end_src
=authorTeX= is used to generate =\author{...}=.

Since I will be using LaTeX macros a lot, Let me define a one-argument LaTeX macro:
#+begin_src haskell :noweb-ref type-function
  cs1 :: Text -> Text -> Text
  cs1 cs arg1 = "\\" <> cs <> "{" <> arg1 <> "}"
#+end_src
Now I can define =authorTeX=:
#+begin_src haskell :noweb-ref type-function
  authorTeX  = cs1 "author"
#+end_src

=fromMaybe= needs to be imported from =Data.Maybe= library:
#+begin_src haskell :noweb-ref type-imports
  import Data.Maybe
#+end_src

=zip= and =foldl1= should not be imported from =Data.Text= so:
#+begin_src haskell :noweb-ref type-data-text-hide
  zip,foldl1,
#+end_src

=unlines= should not be imported from =Prelude=:
#+begin_src haskell :noweb-ref type-prelude-hide
  unlines,
#+end_src
or =Data.List=:
#+begin_src haskell :noweb-ref type-data-list-hide
  unlines,
#+end_src

=unTeXlines= puts =\\= at the end of each line:
#+begin_src haskell :noweb-ref type-function
  unTeXlines = intercalate ("\\\\" <> singleton '\n')
#+end_src
and =intercalate= and =singleton= should not be imported from =Data.List=:
#+begin_src haskell :noweb-ref type-data-list-hide
  intercalate,singleton,
#+end_src

