index.html

<div id="outline-container-org13b6859" class="outline-4">
<h4 id="org13b6859"><span class="section-number-4">2.1.3.</span> AuthorTitle</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Define a class that allows data be converted to LaTeX strings:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">class</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> a <span style="color: #531ab6; font-weight: bold;">where</span>
    totitle <span style="color: #005e8b;">::</span> a <span style="color: #005e8b;">-&gt;</span> <span style="color: #000000;">[</span><span style="color: #005f5f; font-weight: bold;">Affiliation</span><span style="color: #000000;">]</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
</pre>
</div>
<p>
This <code>totitle</code> function takes the data and the affiliation list, then returns the LaTeX string.
</p>

<p>
Define a <code>simpletitle</code> command to convert the data when the affiliation list is not needed:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">simpletitle</span> <span style="color: #005e8b;">::</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">LaTeXable</span> a<span style="color: #000000;">)</span> <span style="color: #005e8b;">=&gt;</span> a <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
<span style="color: #721045;">simpletitle</span> <span style="color: #005e8b;">=</span> flip totitle <span style="color: #000000; font-weight: bold;">[]</span>
</pre>
</div>
<p>
It’s just not necessary to define it in the <code>LaTeXable</code> class.
</p>

<p>
The <code>YAML</code> configuration consists of two entries: a title, and an author list:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">data</span> <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span>
                   <span style="color: #000000;">{</span> title   <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Title</span>
                   , authors <span style="color: #005e8b;">::</span> <span style="color: #dd22dd;">[</span><span style="color: #005f5f; font-weight: bold;">Author</span><span style="color: #dd22dd;">]</span>
                   <span style="color: #000000;">}</span> <span style="color: #531ab6; font-weight: bold;">deriving</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Show</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
We need to read the <code>title</code> entry to the <code>title</code> field (first one) and the <code>authors</code> entry to the <code>authors</code> field (second one):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">FromJSON</span> <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  parseJSON <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Object</span> v<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span>
    <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span>    <span style="color: #005e8b;">&lt;$&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"title"</span> <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"authors"</span>
  parseJSON <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> fail <span style="color: #3548cf;">"Expected Object for Config value"</span>
</pre>
</div>
<p>
<code>FromJSON</code> and other stuffs need to be imported from <code>Data.Yaml</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Data.Yaml</span>
</pre>
</div>
<p>
and these fancy operators <code>&lt;$&gt;</code>, <code>&lt;*&gt;</code> from <code>Control.Applicative</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Control.Applicative</span>
</pre>
</div>

<p>
Converting <code>AuthorTitle</code> to LaTeX is easy: converting both <code>title</code> and <code>authors</code>, then stick them together with a newline character:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  totitle <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">AuthorTitle</span> t as<span style="color: #000000;">)</span> <span style="color: #531ab6; font-weight: bold;">_</span>  <span style="color: #005e8b;">=</span> unlines <span style="color: #000000;">[</span>totitle t affs, authorTeX <span style="color: #dd22dd;">(</span>unTeXlines <span style="color: #008899;">(</span><span style="color: #972500;">[</span>unlines auths<span style="color: #972500;">]</span> <span style="color: #005e8b;">&lt;&gt;</span> fmap toAff <span style="color: #972500;">(</span>zip <span style="color: #808000;">[</span><span style="color: #0000b0;">1</span><span style="color: #005e8b;">..</span><span style="color: #808000;">]</span> affs<span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">]</span>
    <span style="color: #531ab6; font-weight: bold;">where</span>
      affs <span style="color: #005e8b;">=</span> fromMaybe <span style="color: #000000; font-weight: bold;">[]</span> <span style="color: #000000;">(</span>nub <span style="color: #005e8b;">&lt;$&gt;</span> <span style="color: #dd22dd;">(</span>foldl1 <span style="color: #008899;">(</span><span style="color: #005e8b;">&lt;&gt;</span><span style="color: #008899;">)</span> <span style="color: #005e8b;">$</span> fmap addresses as<span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
      auths <span style="color: #005e8b;">=</span> fmap <span style="color: #000000;">(</span>flip totitle affs<span style="color: #000000;">)</span> as
      toAff <span style="color: #000000;">(</span>n,aff<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span> supTeX <span style="color: #000000;">(</span><span style="color: #dd22dd;">(</span>pack<span style="color: #005e8b;">.</span>show<span style="color: #dd22dd;">)</span> n<span style="color: #000000;">)</span> <span style="color: #005e8b;">&lt;&gt;</span> totitle aff affs
</pre>
</div>
<p>
<code>authorTeX</code> is used to generate <code>\author{...}</code>.
</p>

<p>
Since I will be using LaTeX macros a lot, Let me define a one-argument LaTeX macro:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">cs1</span> <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Text</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Text</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
<span style="color: #721045;">cs1</span> cs arg1 <span style="color: #005e8b;">=</span> <span style="color: #3548cf;">"\\"</span> <span style="color: #005e8b;">&lt;&gt;</span> cs <span style="color: #005e8b;">&lt;&gt;</span> <span style="color: #3548cf;">"{"</span> <span style="color: #005e8b;">&lt;&gt;</span> arg1 <span style="color: #005e8b;">&lt;&gt;</span> <span style="color: #3548cf;">"}"</span>
</pre>
</div>
<p>
Now I can define <code>authorTeX</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">authorTeX</span>  <span style="color: #005e8b;">=</span> cs1 <span style="color: #3548cf;">"author"</span>
</pre>
</div>

<p>
<code>fromMaybe</code> needs to be imported from <code>Data.Maybe</code> library:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">Data.Maybe</span>
</pre>
</div>

<p>
<code>zip</code> and <code>foldl1</code> should not be imported from <code>Data.Text</code> so:
</p>
<div class="org-src-container">
<pre class="src src-haskell">zip,foldl1,
</pre>
</div>

<p>
<code>unlines</code> should not be imported from <code>Prelude</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">unlines,
</pre>
</div>
<p>
or <code>Data.List</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">unlines,
</pre>
</div>

<p>
<code>unTeXlines</code> puts <code>\\</code> at the end of each line:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">unTeXlines</span> <span style="color: #005e8b;">=</span> intercalate <span style="color: #000000;">(</span><span style="color: #3548cf;">"\\\\"</span> <span style="color: #005e8b;">&lt;&gt;</span> singleton <span style="color: #3548cf;">'\n'</span><span style="color: #000000;">)</span>
</pre>
</div>
<p>
and <code>intercalate</code> and <code>singleton</code> should not be imported from <code>Data.List</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">intercalate,singleton,
</pre>
</div>
</div>

<ol class="org-ol">
