README.org
**** Title

The =Title= data type consists of a caption and probably a list of funds:
#+begin_src haskell
  data Title = Title
               { caption :: Text
               , funds   :: Maybe [Fund]
               } deriving (Show)
#+end_src
where =Fund= is an alias of =Text= for now:
#+begin_src haskell
  type Fund = Text
#+end_src

The =FromJSON= instance is straightforward:
#+begin_src haskell
  instance FromJSON Title where
    parseJSON (Object v) =
      Title            <$>
      v .:   "caption" <*>
      v .:?  "funds"
    parseJSON _ = fail "Expected Object for Config value"
#+end_src
and converting =Title= to LaTeX is put the caption and the list of funds in the =\title= micro:
#+begin_src haskell
  instance LaTeXable Title where
    totitle (Title cap fs) _  = titleTeX $ cap <> sep (fromMaybe [] $ fmap (fmap thanksTeX) fs)
#+end_src
where =titleTeX= is used to generate =\title{...}=:
#+begin_src haskell :noweb-ref type-function
  titleTeX  = cs1 "title"
#+end_src
and likewise =thanksTeX=:
#+begin_src haskell :noweb-ref type-function
  thanksTeX = cs1 "thanks"
#+end_src

=sep= concatenates the list of =Text= strings and intercalates =\textsuperscript{,}= in-between:
#+begin_src haskell :noweb-ref type-function
  supTeX    = cs1 "textsuperscript"
  supComma  = supTeX ","
  sep       = intercalate supComma
#+end_src


