index.html
<li><a id="org4a1be9c"></a>Title<br />
<div class="outline-text-5" id="text-2-1-3-1">
<p>
The <code>Title</code> data type consists of a caption and probably a list of funds:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">data</span> <span style="color: #005f5f; font-weight: bold;">Title</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Title</span>
             <span style="color: #000000;">{</span> caption <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
             , funds   <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #dd22dd;">[</span><span style="color: #005f5f; font-weight: bold;">Fund</span><span style="color: #dd22dd;">]</span>
             <span style="color: #000000;">}</span> <span style="color: #531ab6; font-weight: bold;">deriving</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Show</span><span style="color: #000000;">)</span>
</pre>
</div>
<p>
where <code>Fund</code> is an alias of <code>Text</code> for now:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">type</span> <span style="color: #005f5f; font-weight: bold;">Fund</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
</pre>
</div>

<p>
The <code>FromJSON</code> instance is straightforward:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">FromJSON</span> <span style="color: #005f5f; font-weight: bold;">Title</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  parseJSON <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Object</span> v<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span>
    <span style="color: #005f5f; font-weight: bold;">Title</span>            <span style="color: #005e8b;">&lt;$&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"caption"</span> <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:?</span>  <span style="color: #3548cf;">"funds"</span>
  parseJSON <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> fail <span style="color: #3548cf;">"Expected Object for Config value"</span>
</pre>
</div>
<p>
and converting <code>Title</code> to LaTeX is put the caption and the list of funds in the <code>\title</code> micro:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">Title</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  totitle <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Title</span> cap fs<span style="color: #000000;">)</span> <span style="color: #531ab6; font-weight: bold;">_</span>  <span style="color: #005e8b;">=</span> titleTeX <span style="color: #005e8b;">$</span> cap <span style="color: #005e8b;">&lt;&gt;</span> sep <span style="color: #000000;">(</span>fromMaybe <span style="color: #dd22dd; font-weight: bold;">[]</span> <span style="color: #005e8b;">$</span> fmap <span style="color: #dd22dd;">(</span>fmap thanksTeX<span style="color: #dd22dd;">)</span> fs<span style="color: #000000;">)</span>
</pre>
</div>
<p>
where <code>titleTeX</code> is used to generate <code>\title{...}</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">titleTeX</span>  <span style="color: #005e8b;">=</span> cs1 <span style="color: #3548cf;">"title"</span>
</pre>
</div>
<p>
and likewise <code>thanksTeX</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">thanksTeX</span> <span style="color: #005e8b;">=</span> cs1 <span style="color: #3548cf;">"thanks"</span>
</pre>
</div>

<p>
<code>sep</code> concatenates the list of <code>Text</code> strings and intercalates <code>\textsuperscript{,}</code> in-between:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">supTeX</span>    <span style="color: #005e8b;">=</span> cs1 <span style="color: #3548cf;">"textsuperscript"</span>
<span style="color: #721045;">supComma</span>  <span style="color: #005e8b;">=</span> supTeX <span style="color: #3548cf;">","</span>
<span style="color: #721045;">sep</span>       <span style="color: #005e8b;">=</span> intercalate supComma
</pre>
</div>
</div>
</li>
