README.org
**** Author

=Author= has the following fields: a name, an email, probably a list of affiliations and whether the author is a primary author.
#+begin_src haskell
  data Author = Author
                { name       :: Name
                , email      :: Email
                , addresses  :: Maybe [Affiliation]
                , isPrimary  :: Bool
                } deriving (Show)
#+end_src

#+begin_src haskell
  instance FromJSON Author where
    parseJSON (Object v) =
      Author             <$>
      v .:   "name"      <*>
      v .:   "email"     <*>
      v .:?  "addresses" <*>
      (maybePrimary <$> (v .:? "type" .!= Just "other" :: Parser (Maybe Text)))
    parseJSON _ = fail "Expected Object for Config value"
#+end_src

The =maybePrimary= function will check whether the =type= field in the =YAML= configuration is =primary= (case insensitive):
#+begin_src haskell :noweb-ref type-function
  maybePrimary :: Maybe Text -> Bool
  maybePrimary (Just str) = (== "primary").toLower $ str
  maybePrimary _ = False
#+end_src

Converting =Author= to LaTeX will really use the affiliation list this time.
#+begin_src haskell
  instance LaTeXable Author where
    totitle (Author nm em addrs isP) affs = totitle nm affs <> sep (thankslst <> catMaybes (fmap (flip addrIndex affs) (fromMaybe [] addrs)))
      where thankslst =
              if isP
              then [totitle em affs]
              else []
#+end_src

=addrIndex= returns the index of the affiliation if found in the list:
#+begin_src haskell :noweb-ref type-function
  addrIndex :: Affiliation -> [Affiliation] -> Maybe Text
  addrIndex aff affs = (supTeX.pack.show.(+1)) <$> aff `elemIndex` affs
#+end_src

=Email= is an alias of =Text=:
#+begin_src haskell
  type Email = Text
#+end_src
and is easy to be converted to LaTeX:
#+begin_src haskell
  instance LaTeXable Email where
    totitle eml _ = thanksTeX eml
#+end_src

=Name= and =Affiliation= is more complicated.

***** Name

=Name= has fields of =firstName=, =lastName= and probably =initials=:
#+begin_src haskell
  data Name = Name
              { firstName :: Text
              , lastName  :: Text
              , initials  :: Maybe Text
              } deriving (Show)
#+end_src
and reads directly from:
#+begin_src haskell
  instance FromJSON Name where
    parseJSON (Object v) =
      Name               <$>
      v .:   "firstName" <*>
      v .:   "lastName"  <*>
      v .:?  "initials"
    parseJSON _ = fail "Expected Object for Config value"
#+end_src

=firstName lastName= would be the LaTeX representation:
#+begin_src haskell
  instance LaTeXable Name where
      totitle (Name fnm lnm ini) _ = unwords [fnm,lnm] -- firstname lastname
#+end_src

Of course, =unwords= should be imported from =Data.Text= rather than from =Prelude=:
#+begin_src haskell :noweb-ref type-prelude-hide
  unwords,
#+end_src
nor from =Data.List=:
#+begin_src haskell :noweb-ref type-data-list-hide
  unwords,
#+end_src

