index.html


<li><a id="orgb5a9757"></a>Author<br />
<div class="outline-text-5" id="text-2-1-3-2">
<p>
<code>Author</code> has the following fields: a name, an email, probably a list of affiliations and whether the author is a primary author.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">data</span> <span style="color: #005f5f; font-weight: bold;">Author</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Author</span>
              <span style="color: #000000;">{</span> name       <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Name</span>
              , email      <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Email</span>
              , addresses  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #dd22dd;">[</span><span style="color: #005f5f; font-weight: bold;">Affiliation</span><span style="color: #dd22dd;">]</span>
              , isPrimary  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Bool</span>
              <span style="color: #000000;">}</span> <span style="color: #531ab6; font-weight: bold;">deriving</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Show</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">FromJSON</span> <span style="color: #005f5f; font-weight: bold;">Author</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  parseJSON <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Object</span> v<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span>
    <span style="color: #005f5f; font-weight: bold;">Author</span>             <span style="color: #005e8b;">&lt;$&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"name"</span>      <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"email"</span>     <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:?</span>  <span style="color: #3548cf;">"addresses"</span> <span style="color: #005e8b;">&lt;*&gt;</span>
    <span style="color: #000000;">(</span>maybePrimary <span style="color: #005e8b;">&lt;$&gt;</span> <span style="color: #dd22dd;">(</span>v <span style="color: #005e8b;">.:?</span> <span style="color: #3548cf;">"type"</span> <span style="color: #005e8b;">.!=</span> <span style="color: #005f5f; font-weight: bold;">Just</span> <span style="color: #3548cf;">"other"</span> <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Parser</span> <span style="color: #008899;">(</span><span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
  parseJSON <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> fail <span style="color: #3548cf;">"Expected Object for Config value"</span>
</pre>
</div>

<p>
The <code>maybePrimary</code> function will check whether the <code>type</code> field in the <code>YAML</code> configuration is <code>primary</code> (case insensitive):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">maybePrimary</span> <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Bool</span>
<span style="color: #721045;">maybePrimary</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Just</span> str<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span> <span style="color: #000000;">(</span><span style="color: #005e8b;">==</span> <span style="color: #3548cf;">"primary"</span><span style="color: #000000;">)</span><span style="color: #005e8b;">.</span>toLower <span style="color: #005e8b;">$</span> str
<span style="color: #721045;">maybePrimary</span> <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">False</span>
</pre>
</div>

<p>
Converting <code>Author</code> to LaTeX will really use the affiliation list this time.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">Author</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  totitle <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Author</span> nm em addrs isP<span style="color: #000000;">)</span> affs <span style="color: #005e8b;">=</span> totitle nm affs <span style="color: #005e8b;">&lt;&gt;</span> sep <span style="color: #000000;">(</span>thankslst <span style="color: #005e8b;">&lt;&gt;</span> catMaybes <span style="color: #dd22dd;">(</span>fmap <span style="color: #008899;">(</span>flip addrIndex affs<span style="color: #008899;">)</span> <span style="color: #008899;">(</span>fromMaybe <span style="color: #972500; font-weight: bold;">[]</span> addrs<span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
    <span style="color: #531ab6; font-weight: bold;">where</span> thankslst <span style="color: #005e8b;">=</span>
            <span style="color: #531ab6; font-weight: bold;">if</span> isP
            <span style="color: #531ab6; font-weight: bold;">then</span> <span style="color: #000000;">[</span>totitle em affs<span style="color: #000000;">]</span>
            <span style="color: #531ab6; font-weight: bold;">else</span> <span style="color: #000000; font-weight: bold;">[]</span>
</pre>
</div>

<p>
<code>addrIndex</code> returns the index of the affiliation if found in the list:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #721045;">addrIndex</span> <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Affiliation</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #000000;">[</span><span style="color: #005f5f; font-weight: bold;">Affiliation</span><span style="color: #000000;">]</span> <span style="color: #005e8b;">-&gt;</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
<span style="color: #721045;">addrIndex</span> aff affs <span style="color: #005e8b;">=</span> <span style="color: #000000;">(</span>supTeX<span style="color: #005e8b;">.</span>pack<span style="color: #005e8b;">.</span>show<span style="color: #005e8b;">.</span><span style="color: #dd22dd;">(</span><span style="color: #005e8b;">+</span><span style="color: #0000b0;">1</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span> <span style="color: #005e8b;">&lt;$&gt;</span> aff <span style="color: #005e8b;">`elemIndex`</span> affs
</pre>
</div>

<p>
<code>Email</code> is an alias of <code>Text</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">type</span> <span style="color: #005f5f; font-weight: bold;">Email</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
</pre>
</div>
<p>
and is easy to be converted to LaTeX:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">Email</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  totitle eml <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> thanksTeX eml
</pre>
</div>

<p>
<code>Name</code> and <code>Affiliation</code> is more complicated.
</p>
</div>

<ol class="org-ol">
<li><a id="org04f09a6"></a>Name<br />
<div class="outline-text-6" id="text-2-1-3-2-1">
<p>
<code>Name</code> has fields of <code>firstName</code>, <code>lastName</code> and probably <code>initials</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">data</span> <span style="color: #005f5f; font-weight: bold;">Name</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Name</span>
            <span style="color: #000000;">{</span> firstName <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
            , lastName  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
            , initials  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
            <span style="color: #000000;">}</span> <span style="color: #531ab6; font-weight: bold;">deriving</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Show</span><span style="color: #000000;">)</span>
</pre>
</div>
<p>
and reads directly from:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">FromJSON</span> <span style="color: #005f5f; font-weight: bold;">Name</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  parseJSON <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Object</span> v<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span>
    <span style="color: #005f5f; font-weight: bold;">Name</span>               <span style="color: #005e8b;">&lt;$&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"firstName"</span> <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"lastName"</span>  <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:?</span>  <span style="color: #3548cf;">"initials"</span>
  parseJSON <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> fail <span style="color: #3548cf;">"Expected Object for Config value"</span>
</pre>
</div>

<p>
<code>firstName lastName</code> would be the LaTeX representation:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">Name</span> <span style="color: #531ab6; font-weight: bold;">where</span>
    totitle <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Name</span> fnm lnm ini<span style="color: #000000;">)</span> <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> unwords <span style="color: #000000;">[</span>fnm,lnm<span style="color: #000000;">]</span> <span style="color: #7f0000; font-style: italic;">-- </span><span style="color: #7f0000; font-style: italic;">firstname lastname</span>
</pre>
</div>

<p>
Of course, <code>unwords</code> should be imported from <code>Data.Text</code> rather than from <code>Prelude</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">unwords,
</pre>
</div>
<p>
nor from <code>Data.List</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">unwords,
</pre>
</div>
</div>
</li>
