README.org
***** Affiliation

=Affiliation= has it name and probably an address and a zip code:
#+begin_src haskell
  data Affiliation = Affiliation
                     { affName  :: Text
                     , adress   :: Maybe Text
                     , zipcode  :: Maybe Text
                     } deriving (Show,Eq)
#+end_src
The reason I define =Affiliation= as an =Eq= class is because we need to locate the affiliation by comparing them.
#+begin_src haskell
  instance FromJSON Affiliation where
    parseJSON (Object v) =
      Affiliation      <$>
      v .:   "name"    <*>
      v .:?  "address" <*>
      v .:?  "zip"
    parseJSON _ = fail "Expected Object for Config value"
#+end_src
Append the address and/or the zip code when they are available:
#+begin_src haskell
  instance LaTeXable Affiliation where
    totitle aff _ = affName aff                                                    -- name
                    <> fromMaybe "" (((<>) ", ") <$> adress aff)                   -- , address
                    <> fromMaybe "" (((<>) ", ") <$> zipcode aff)                  -- , zip
#+end_src

