index.html

<li><a id="org0c7e526"></a>Affiliation<br />
<div class="outline-text-6" id="text-2-1-3-2-2">
<p>
<code>Affiliation</code> has it name and probably an address and a zip code:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">data</span> <span style="color: #005f5f; font-weight: bold;">Affiliation</span> <span style="color: #005e8b;">=</span> <span style="color: #005f5f; font-weight: bold;">Affiliation</span>
                   <span style="color: #000000;">{</span> affName  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
                   , adress   <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
                   , zipcode  <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Maybe</span> <span style="color: #005f5f; font-weight: bold;">Text</span>
                   <span style="color: #000000;">}</span> <span style="color: #531ab6; font-weight: bold;">deriving</span> <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Show</span>,<span style="color: #005f5f; font-weight: bold;">Eq</span><span style="color: #000000;">)</span>
</pre>
</div>
<p>
The reason I define <code>Affiliation</code> as an <code>Eq</code> class is because we need to locate the affiliation by comparing them.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">FromJSON</span> <span style="color: #005f5f; font-weight: bold;">Affiliation</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  parseJSON <span style="color: #000000;">(</span><span style="color: #005f5f; font-weight: bold;">Object</span> v<span style="color: #000000;">)</span> <span style="color: #005e8b;">=</span>
    <span style="color: #005f5f; font-weight: bold;">Affiliation</span>      <span style="color: #005e8b;">&lt;$&gt;</span>
    v <span style="color: #005e8b;">.:</span>   <span style="color: #3548cf;">"name"</span>    <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:?</span>  <span style="color: #3548cf;">"address"</span> <span style="color: #005e8b;">&lt;*&gt;</span>
    v <span style="color: #005e8b;">.:?</span>  <span style="color: #3548cf;">"zip"</span>
  parseJSON <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> fail <span style="color: #3548cf;">"Expected Object for Config value"</span>
</pre>
</div>
<p>
Append the address and/or the zip code when they are available:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">instance</span> <span style="color: #005f5f; font-weight: bold;">LaTeXable</span> <span style="color: #005f5f; font-weight: bold;">Affiliation</span> <span style="color: #531ab6; font-weight: bold;">where</span>
  totitle aff <span style="color: #531ab6; font-weight: bold;">_</span> <span style="color: #005e8b;">=</span> affName aff                                                    <span style="color: #7f0000; font-style: italic;">-- </span><span style="color: #7f0000; font-style: italic;">name</span>
                  <span style="color: #005e8b;">&lt;&gt;</span> fromMaybe <span style="color: #3548cf;">""</span> <span style="color: #000000;">(</span><span style="color: #dd22dd;">(</span><span style="color: #008899;">(</span><span style="color: #005e8b;">&lt;&gt;</span><span style="color: #008899;">)</span> <span style="color: #3548cf;">", "</span><span style="color: #dd22dd;">)</span> <span style="color: #005e8b;">&lt;$&gt;</span> adress aff<span style="color: #000000;">)</span>                   <span style="color: #7f0000; font-style: italic;">-- </span><span style="color: #7f0000; font-style: italic;">, address</span>
                  <span style="color: #005e8b;">&lt;&gt;</span> fromMaybe <span style="color: #3548cf;">""</span> <span style="color: #000000;">(</span><span style="color: #dd22dd;">(</span><span style="color: #008899;">(</span><span style="color: #005e8b;">&lt;&gt;</span><span style="color: #008899;">)</span> <span style="color: #3548cf;">", "</span><span style="color: #dd22dd;">)</span> <span style="color: #005e8b;">&lt;$&gt;</span> zipcode aff<span style="color: #000000;">)</span>                  <span style="color: #7f0000; font-style: italic;">-- </span><span style="color: #7f0000; font-style: italic;">, zip</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
