index.html

<div id="outline-container-org2840d93" class="outline-3">
<h3 id="org2840d93"><span class="section-number-3">2.2.</span> YAML generation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In case I could make mistakes in the data type codes in <code>Haskell</code>, I will use <code>Python</code> to generate the configuration file to make it independent.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #531ab6; font-weight: bold;">import</span> yaml

<span style="color: #531ab6; font-weight: bold;">class</span> <span style="color: #005f5f; font-weight: bold;">JACoW</span>:
    <span style="color: #531ab6; font-weight: bold;">pass</span>

<span style="color: #005e8b;">mypaper</span> = <span style="color: #000000;">{}</span>
<span style="color: #005e8b;">mypaper</span><span style="color: #000000;">[</span><span style="color: #3548cf;">'title'</span><span style="color: #000000;">]</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'caption'</span>: <span style="color: #3548cf;">'This is a title'</span>,
    <span style="color: #3548cf;">'funds'</span>: <span style="color: #dd22dd;">[</span><span style="color: #3548cf;">'Fund A'</span>, <span style="color: #3548cf;">'Fund B'</span><span style="color: #dd22dd;">]</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">inst1</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #3548cf;">'Inst. A'</span>,
    <span style="color: #3548cf;">'address'</span>: <span style="color: #3548cf;">'Somewhere'</span>,
    <span style="color: #3548cf;">'zip'</span>: <span style="color: #3548cf;">'121212'</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">inst2</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #3548cf;">'Inst. B'</span>,
    <span style="color: #3548cf;">'address'</span>: <span style="color: #3548cf;">'Somewhere'</span>,
    <span style="color: #3548cf;">'zip'</span>: <span style="color: #3548cf;">'131313'</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">inst3</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #3548cf;">'Inst. C'</span>,
    <span style="color: #3548cf;">'address'</span>: <span style="color: #3548cf;">'Somewhere'</span>,
    <span style="color: #3548cf;">'zip'</span>: <span style="color: #3548cf;">'141414'</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">author1</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #dd22dd;">{</span>
        <span style="color: #3548cf;">'firstName'</span>: <span style="color: #3548cf;">'John'</span>,
        <span style="color: #3548cf;">'lastName'</span>: <span style="color: #3548cf;">'Doe'</span>,
        <span style="color: #3548cf;">'initials'</span>: <span style="color: #3548cf;">'J.'</span>,
        <span style="color: #3548cf;">'dateOfBirth'</span>: <span style="color: #3548cf;">'whocares'</span>
           <span style="color: #dd22dd;">}</span>,
    <span style="color: #3548cf;">'type'</span>: <span style="color: #3548cf;">'primary'</span>,
    <span style="color: #3548cf;">'email'</span>: <span style="color: #3548cf;">'john.doe@first.author'</span>,
    <span style="color: #3548cf;">'addresses'</span>: <span style="color: #dd22dd;">[</span> inst1, inst2, inst3 <span style="color: #dd22dd;">]</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">author2</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #dd22dd;">{</span>
        <span style="color: #3548cf;">'firstName'</span>: <span style="color: #3548cf;">'Jane'</span>,
        <span style="color: #3548cf;">'lastName'</span>: <span style="color: #3548cf;">'Doe'</span>,
        <span style="color: #3548cf;">'initials'</span>: <span style="color: #3548cf;">'J.'</span>,
        <span style="color: #3548cf;">'dateOfBirth'</span>: <span style="color: #3548cf;">'whocares'</span>
           <span style="color: #dd22dd;">}</span>,
    <span style="color: #3548cf;">'type'</span>: <span style="color: #3548cf;">'secondary'</span>,
    <span style="color: #3548cf;">'email'</span>: <span style="color: #3548cf;">'jane.doe@second.author'</span>,
    <span style="color: #3548cf;">'addresses'</span>: <span style="color: #dd22dd;">[</span> inst2, inst3 <span style="color: #dd22dd;">]</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">author3</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #dd22dd;">{</span>
        <span style="color: #3548cf;">'firstName'</span>: <span style="color: #3548cf;">'Jack'</span>,
        <span style="color: #3548cf;">'lastName'</span>: <span style="color: #3548cf;">'Doe'</span>,
        <span style="color: #3548cf;">'initials'</span>: <span style="color: #3548cf;">'J.'</span>,
        <span style="color: #3548cf;">'dateOfBirth'</span>: <span style="color: #3548cf;">'whocares'</span>
           <span style="color: #dd22dd;">}</span>,
    <span style="color: #3548cf;">'email'</span>: <span style="color: #3548cf;">'jack.doe@third.author'</span>,
    <span style="color: #3548cf;">'addresses'</span>: <span style="color: #531ab6; font-weight: bold;">None</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">author4</span> = <span style="color: #000000;">{</span>
    <span style="color: #3548cf;">'name'</span>: <span style="color: #dd22dd;">{</span>
        <span style="color: #3548cf;">'firstName'</span>: <span style="color: #3548cf;">'Judy'</span>,
        <span style="color: #3548cf;">'lastName'</span>: <span style="color: #3548cf;">'Doe'</span>,
        <span style="color: #3548cf;">'initials'</span>: <span style="color: #3548cf;">'J.'</span>,
        <span style="color: #3548cf;">'dateOfBirth'</span>: <span style="color: #3548cf;">'whocares'</span>
           <span style="color: #dd22dd;">}</span>,
    <span style="color: #3548cf;">'type'</span>: <span style="color: #3548cf;">'Primary'</span>,
    <span style="color: #3548cf;">'email'</span>: <span style="color: #3548cf;">'judy.doe@fourth.author'</span>,
    <span style="color: #3548cf;">'addresses'</span>: <span style="color: #dd22dd;">[</span> inst1, inst3 <span style="color: #dd22dd;">]</span>
<span style="color: #000000;">}</span>

<span style="color: #005e8b;">mypaper</span><span style="color: #000000;">[</span><span style="color: #3548cf;">'authors'</span><span style="color: #000000;">]</span> = <span style="color: #000000;">[</span>author1,author2,author3,author4<span style="color: #000000;">]</span>

<span style="color: #005e8b;">mypaper_yaml</span> = yaml.safe_dump<span style="color: #000000;">(</span>mypaper,sort_keys=<span style="color: #531ab6; font-weight: bold;">False</span><span style="color: #000000;">)</span>

<span style="color: #531ab6; font-weight: bold;">with</span> <span style="color: #8f0075; font-weight: bold;">open</span><span style="color: #000000;">(</span><span style="color: #3548cf;">'mypaper.yaml'</span>, <span style="color: #3548cf;">'wt'</span><span style="color: #000000;">)</span> <span style="color: #531ab6; font-weight: bold;">as</span> mypaper_info:
    mypaper_info.write<span style="color: #000000;">(</span>mypaper_yaml<span style="color: #000000;">)</span>

</pre>
</div>



<p>
After running the script:
</p>
<div class="org-src-container">
<pre class="src src-shell">./py-to-yml.py
</pre>
</div>

<p>
Now the <code>YAML</code> file looks like this:
</p>
<div class="org-src-container">
<pre class="src src-shell">cat mypaper.yaml
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #005e8b;">title</span>:
  <span style="color: #005e8b;">caption</span>: This is a title
  <span style="color: #005e8b;">funds</span>:
  - Fund A
  - Fund B
<span style="color: #005e8b;">authors</span>:
- <span style="color: #005e8b;">name</span>:
    <span style="color: #005e8b;">firstName</span>: John
    <span style="color: #005e8b;">lastName</span>: Doe
    <span style="color: #005e8b;">initials</span>: J.
    <span style="color: #005e8b;">dateOfBirth</span>: whocares
  <span style="color: #005e8b;">type</span>: primary
  <span style="color: #005e8b;">email</span>: john.doe@first.author
  <span style="color: #005e8b;">addresses</span>:
  - <span style="color: #721045;">&amp;id003</span>
    <span style="color: #005e8b;">name</span>: Inst. A
    <span style="color: #005e8b;">address</span>: Somewhere
    <span style="color: #005e8b;">zip</span>: <span style="color: #3548cf;">'121212'</span>
  - <span style="color: #721045;">&amp;id001</span>
    <span style="color: #005e8b;">name</span>: Inst. B
    <span style="color: #005e8b;">address</span>: Somewhere
    <span style="color: #005e8b;">zip</span>: <span style="color: #3548cf;">'131313'</span>
  - <span style="color: #721045;">&amp;id002</span>
    <span style="color: #005e8b;">name</span>: Inst. C
    <span style="color: #005e8b;">address</span>: Somewhere
    <span style="color: #005e8b;">zip</span>: <span style="color: #3548cf;">'141414'</span>
- <span style="color: #005e8b;">name</span>:
    <span style="color: #005e8b;">firstName</span>: Jane
    <span style="color: #005e8b;">lastName</span>: Doe
    <span style="color: #005e8b;">initials</span>: J.
    <span style="color: #005e8b;">dateOfBirth</span>: whocares
  <span style="color: #005e8b;">type</span>: secondary
  <span style="color: #005e8b;">email</span>: jane.doe@second.author
  <span style="color: #005e8b;">addresses</span>:
  - <span style="color: #721045;">*id001</span>
  - <span style="color: #721045;">*id002</span>
- <span style="color: #005e8b;">name</span>:
    <span style="color: #005e8b;">firstName</span>: Jack
    <span style="color: #005e8b;">lastName</span>: Doe
    <span style="color: #005e8b;">initials</span>: J.
    <span style="color: #005e8b;">dateOfBirth</span>: whocares
  <span style="color: #005e8b;">email</span>: jack.doe@third.author
  <span style="color: #005e8b;">addresses</span>: <span style="color: #0000b0;">null</span>
- <span style="color: #005e8b;">name</span>:
    <span style="color: #005e8b;">firstName</span>: Judy
    <span style="color: #005e8b;">lastName</span>: Doe
    <span style="color: #005e8b;">initials</span>: J.
    <span style="color: #005e8b;">dateOfBirth</span>: whocares
  <span style="color: #005e8b;">type</span>: Primary
  <span style="color: #005e8b;">email</span>: judy.doe@fourth.author
  <span style="color: #005e8b;">addresses</span>:
  - <span style="color: #721045;">*id003</span>
  - <span style="color: #721045;">*id002</span>
</pre>
</div>
</div>
</div>
</div>
