README.org
* Application

#+begin_src haskell :tangle yml2tex.hs
  module Main where

  import JACoW.Types
  import qualified Data.Yaml as Y
  import qualified Data.Text.IO as TIO
  import qualified Data.ByteString.Char8 as BS

  main = do
    ymlData <- BS.readFile "mypaper.yaml"
    let authortitle = Y.decodeEither' ymlData :: Either Y.ParseException AuthorTitle
    TIO.writeFile "mypaper-hs.tex" $ either (error . show) simpletitle authortitle
#+end_src


You can run the script without compiling it:
#+begin_src shell
  runhaskell yml2tex.hs
#+end_src

#+RESULTS:

And the result:
#+begin_src shell :results raw replace :wrap src latex :exports both
  cat mypaper-hs.tex
#+end_src

#+RESULTS:
#+begin_src latex
\title{This is a title\thanks{Fund A}\textsuperscript{,}\thanks{Fund B}}
\author{John Doe\thanks{john.doe@first.author}\textsuperscript{,}\textsuperscript{1}\textsuperscript{,}\textsuperscript{2}\textsuperscript{,}\textsuperscript{3}
Jane Doe\textsuperscript{2}\textsuperscript{,}\textsuperscript{3}
Jack Doe
Judy Doe\thanks{judy.doe@fourth.author}\textsuperscript{,}\textsuperscript{1}\textsuperscript{,}\textsuperscript{3}
\\
\textsuperscript{1}Inst. A, Somewhere, 121212\\
\textsuperscript{2}Inst. B, Somewhere, 131313\\
\textsuperscript{3}Inst. C, Somewhere, 141414}
#+end_src

* Summary

The library looks fine. the =\textsuperscript{,}= is *so* ugly! This should be implemented in the LaTeX class file so that the document is more comprehensible.

