index.html

<div id="outline-container-orgf138fb4" class="outline-2">
<h2 id="orgf138fb4"><span class="section-number-2">3.</span> Application</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">module</span> <span style="color: #005f5f; font-weight: bold;">Main</span> <span style="color: #531ab6; font-weight: bold;">where</span>

<span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #005f5f; font-weight: bold;">JACoW.Types</span>
<span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #531ab6; font-weight: bold;">qualified</span> <span style="color: #005f5f; font-weight: bold;">Data.Yaml</span> <span style="color: #531ab6; font-weight: bold;">as</span> <span style="color: #005f5f; font-weight: bold;">Y</span>
<span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #531ab6; font-weight: bold;">qualified</span> <span style="color: #005f5f; font-weight: bold;">Data.Text.IO</span> <span style="color: #531ab6; font-weight: bold;">as</span> <span style="color: #005f5f; font-weight: bold;">TIO</span>
<span style="color: #531ab6; font-weight: bold;">import</span> <span style="color: #531ab6; font-weight: bold;">qualified</span> <span style="color: #005f5f; font-weight: bold;">Data.ByteString.Char8</span> <span style="color: #531ab6; font-weight: bold;">as</span> <span style="color: #005f5f; font-weight: bold;">BS</span>

<span style="color: #721045;">main</span> <span style="color: #005e8b;">=</span> <span style="color: #531ab6; font-weight: bold;">do</span>
  ymlData <span style="color: #005e8b;">&lt;-</span> BS.readFile <span style="color: #3548cf;">"mypaper.yaml"</span>
  <span style="color: #531ab6; font-weight: bold;">let</span> authortitle <span style="color: #005e8b;">=</span> Y.decodeEither' ymlData <span style="color: #005e8b;">::</span> <span style="color: #005f5f; font-weight: bold;">Either</span> <span style="color: #005f5f; font-weight: bold;">Y.ParseException</span> <span style="color: #005f5f; font-weight: bold;">AuthorTitle</span>
  TIO.writeFile <span style="color: #3548cf;">"mypaper-hs.tex"</span> <span style="color: #005e8b;">$</span> either <span style="color: #000000;">(</span>error <span style="color: #005e8b;">.</span> show<span style="color: #000000;">)</span> simpletitle authortitle
</pre>
</div>


<p>
You can run the script without compiling it:
</p>
<div class="org-src-container">
<pre class="src src-shell">runhaskell yml2tex.hs
</pre>
</div>

<p>
And the result:
</p>
<div class="org-src-container">
<pre class="src src-shell">cat mypaper-hs.tex
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #531ab6; font-weight: bold;">\title</span>{<span style="color: #005f5f; font-weight: bold;">This is a title</span><span style="color: #005f5f; font-weight: bold;">\thanks</span><span style="color: #005f5f; font-weight: bold;">{Fund A}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\thanks</span><span style="color: #005f5f; font-weight: bold;">{Fund B}</span>}
<span style="color: #531ab6; font-weight: bold;">\author</span>{<span style="color: #005f5f; font-weight: bold;">John Doe</span><span style="color: #005f5f; font-weight: bold;">\thanks</span><span style="color: #005f5f; font-weight: bold;">{john.doe@first.author}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{1}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{2}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{3}</span>
<span style="color: #005f5f; font-weight: bold;">Jane Doe</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{2}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{3}</span>
<span style="color: #005f5f; font-weight: bold;">Jack Doe</span>
<span style="color: #005f5f; font-weight: bold;">Judy Doe</span><span style="color: #005f5f; font-weight: bold;">\thanks</span><span style="color: #005f5f; font-weight: bold;">{judy.doe@fourth.author}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{1}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{,}</span><span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{3}</span>
<span style="color: #884900; font-weight: bold;">\\</span>
<span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{1}Inst. A, Somewhere, 121212</span><span style="color: #884900; font-weight: bold;">\\</span>
<span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{2}Inst. B, Somewhere, 131313</span><span style="color: #884900; font-weight: bold;">\\</span>
<span style="color: #005f5f; font-weight: bold;">\textsuperscript</span><span style="color: #005f5f; font-weight: bold;">{3}Inst. C, Somewhere, 141414</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfcd2727" class="outline-2">
<h2 id="orgfcd2727"><span class="section-number-2">4.</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
The library looks fine. the <code>\textsuperscript{,}</code> is <b>so</b> ugly! This should be implemented in the LaTeX class file so that the document is more comprehensible.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joshua Peters, Zhichu Chen (Ross)</p>
<p class="date">Created: 2023-08-29 Tue 21:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>